#+TITLE: Minimal production images
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/distroless.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

For production, I want the smallest possible attack surface. Distroless
images have no shell, no package manager — just my application and its
runtime. But I still need the correct timezone.

#+begin_src python
import dagger
from dagger import dag, function
#+end_src

* Setting the timezone on distroless

  Distroless can't run =apt= or =apk=. We copy the timezone artifacts
  from [[file:alpine.org::*Timezone artifacts for other containers][alpine_tz]] directly into the image — Alpine is lighter than
  Debian and =alpine_tz()= already extracts both =/etc/localtime= and
  =/etc/timezone=.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_file(path, file)]] copies a =File= artifact into the container
  at the given path — like =COPY= in a Dockerfile. This is the only way
  to get files into a distroless image since there is no shell or
  package manager to run.

  #+begin_src python
  @function
  def distroless_set_tz(self, ctr: dagger.Container) -> dagger.Container:
      """Copy timezone artifacts into a distroless container (uses Lib.timezone)."""
      tz = self.alpine_tz()
      return (
          ctr
          .with_file("/etc/localtime", tz.file("localtime"))
          .with_file("/etc/timezone", tz.file("timezone"))
      )
  #+end_src

* Distroless Python 3

  For Python services that need maximum security and minimum image size.

  #+begin_src python
  @function
  def distroless_python3_debian(self) -> dagger.Container:
      """Distroless python3 with timezone set."""
      ctr = dag.container().from_(
          f"gcr.io/distroless/python3-debian{self.debian_version}"
      )
      return self.distroless_set_tz(ctr)
  #+end_src

  #+NAME: distroless_python3
  #+begin_src fixtureyaml
func: distroless-python-3-debian
chain:
  - with-exec: [python3, -c, "import os; print(os.path.exists('/etc/localtime'))"]
  - stdout
  #+end_src

#+RESULTS: distroless_python3
:results:
#+NAME: distroless_python3-run
#+begin_src bash :exports code :eval no-export
dagger call distroless-python-3-debian with-exec --args="python3","-c","import os; print(os.path.exists('/etc/localtime'))" stdout
#+end_src

#+RESULTS[a9a6588e057019cfe9443de81184e36e7b4f65ac]: distroless_python3-run
: True

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/distroless_python3" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<distroless_python3-run()>>
#+END_SRC
:end:

* Distroless static

  For Go or Rust services compiled as static binaries.

  #+begin_src python
  @function
  def distroless_debian(self) -> dagger.Container:
      """Distroless static with timezone set."""
      ctr = dag.container().from_(
          f"gcr.io/distroless/static-debian{self.debian_version}"
      )
      return self.distroless_set_tz(ctr)
  #+end_src

  #+NAME: distroless_static_export
  #+begin_src fixtureyaml
func: distroless-debian
chain:
  - file: /etc/localtime
  - export: $TMP/out/localtime
post: test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

#+RESULTS: distroless_static_export
:results:
#+NAME: distroless_static_export-run
#+begin_src bash :exports code :eval no-export
dagger call distroless-debian file --path="/etc/localtime" export --path="$TMP/out/localtime" > /dev/null
test -s "$TMP/out/localtime" && echo "non-empty"
#+end_src

#+RESULTS[6ec9357537aa901a70c4b4b1c2550594993836c6]: distroless_static_export-run
: non-empty

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/distroless_static_export" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<distroless_static_export-run()>>
#+END_SRC
:end:
